БИТУправление_медицинским_центром_демо/src/Documents/Заявка/Заявка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заявка</name>
  <posting>Deny</posting>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>DefinedType.КомментарийДокумента</types>
    </type>
  </attributes>
  <attributes>
    <name>Перенесенная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НесколькоСотрудников</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>CatalogRef.ВидыСостоянийЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеДляОтката</name>
    <type>
      <types>CatalogRef.ВидыСостоянийЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>Кабинет</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКлиента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ХочуРаньше</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПримечаниеХочуРаньше</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборХочуРаньше</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DefinedType.ОснованиеЗаписиВРасписание</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимДлительностиЗаявки</name>
    <type>
      <types>EnumRef.РежимДлительностиЗаявки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Работы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Продолжительность</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Оборудование1</name>
      <type>
        <types>CatalogRef.Оборудование</types>
      </type>
    </attributes>
    <attributes>
      <name>Оборудование2</name>
      <type>
        <types>CatalogRef.Оборудование</types>
      </type>
    </attributes>
    <attributes>
      <name>Оборудование3</name>
      <type>
        <types>CatalogRef.Оборудование</types>
      </type>
    </attributes>
    <attributes>
      <name>ПродолжительностьИзмененаВручную</name>
      <comment>Используется в форме заявки при установке нормативной продолжительности</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтборыХочуРаньше</name>
    <attributes>
      <name>Фильтр</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
        <types>CatalogRef.КатегорииВыработки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Прейскурант</name>
    <type>
      <types>CatalogRef.Прейскуранты</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ВидыСертификатов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/Enums/ПолФизическихЛиц/ПолФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПолФизическихЛиц</name>
  <comment>Пол физических лиц</comment>
  <enumValues>
    <name>НеУказан</name>
    <comment>Пол не указан</comment>
  </enumValues>
  <enumValues>
    <name>Мужской</name>
    <comment>Пол мужской</comment>
  </enumValues>
  <enumValues>
    <name>Женский</name>
    <comment>Пол женский</comment>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическихЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Комментарий</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УчаствуетВКалендарномПланировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Специализация</name>
    <type>
      <types>CatalogRef.КатегорииВыработки</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>Архив</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойСпособЗаполненияГрафика</name>
    <type>
      <types>CatalogRef.СпособыЗаполненияГрафиковРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьПриема</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеОписание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимДлительностиЗаявки</name>
    <type>
      <types>EnumRef.РежимДлительностиЗаявки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформацияДляЖЗ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СНИЛС</name>
    <comment>Страховой номер индивидуального лицевого счета пенсионного свидетельства </comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Специализации</name>
    <attributes>
      <name>Специализация</name>
      <type>
        <types>CatalogRef.КатегорииВыработки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СпециализацииФРМР</name>
    <attributes>
      <name>Специализация</name>
      <type>
        <types>CatalogRef.КлассификаторыМинЗдрава</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Documents/Заявка/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Возвращает доступные варианты печати документа.
//  Результатом является Струткура, каждая строка которой соответствует одному из вариантов печати.
// 
// Возвращаемое значение:
//  Структура.
//
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураМакетов = Новый Структура;
	СтруктураМакетов.Вставить("Заявка"	,"Заявка");
	СтруктураМакетов.Вставить("ЗаявкаА5","Заявка А5");
	СтруктураМакетов.Вставить("Талон","Талон");
	СтруктураМакетов.Вставить("СтоимостьУслуг", "Предварительная стоимость услуг");
	СтруктураМакетов.Вставить("ПодготовкаКИсследованию"	,"Подготовка к сдаче анализов");
	
	Возврат СтруктураМакетов;

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

// Процедура формирует печатную форму документа
//  Название макета печати передается в качестве параметра,
//  по переданному имени макета определяется соответствующая функция печати.
//
// Параметры:
//  СсылкаНаОбъект	 - ДокументСсылка	 - ссылка на распечатываемый документ.
//  ИмяМакета		 - Строка			 - имя макета из структуры печатных форм.
// 
// Возвращаемое значение:
//  ТабличныйДокумент.
//
Функция Печать(СсылкаНаОбъект, ИмяМакета) Экспорт
	
	Перем ТабДокумент;
	
	// Получить экземпляр документа на печать
	Если ИмяМакета = "Заявка" Тогда
		ТабДокумент = ПечатьЗаявка(СсылкаНаОбъект);
	ИначеЕсли ИмяМакета = "ЗаявкаА5" Тогда
		ТабДокумент = ПечатьЗаявкаА5(СсылкаНаОбъект);
	ИначеЕсли ИмяМакета = "Талон" Тогда
		ТабДокумент = ПечатьТалон(СсылкаНаОбъект);
	ИначеЕсли ИмяМакета = "СтоимостьУслуг" Тогда
		ТабДокумент = ПечатьСтоимостьУслуг(СсылкаНаОбъект);
	ИначеЕсли ИмяМакета = "ПодготовкаКИсследованию" Тогда
		ТабДокумент = ПечатьПодготовкаКИсследованию(СсылкаНаОбъект);
	КонецЕсли;
	
	Возврат ТабДокумент;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьШапкуТелоПечатиЗаявки(СсылкаНаОбъект,ТабДокумент, Макет, ЧислоДопСтрокРабот, ЧислоСтрокМатериалов, Выборка)
	
	Шапка = "ШапкаТаблицы";
	Строка = "Строка";
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.ТекстЗаголовка = ОбщегоНазначения.СформироватьЗаголовокДокумента(СсылкаНаОбъект, "Заявка");
	ТабДокумент.Вывести(ОбластьМакета); 		
	ОбластьМакета = Макет.ПолучитьОбласть("Даты");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", СсылкаНаОбъект);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаявкаРаботы.Номенклатура КАК Работа,
	|	ЗаявкаРаботы.Продолжительность КАК Длительность,
	|	ВЫБОР
	|		КОГДА ЗаявкаРаботы.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|			ТОГДА ЗаявкаРаботы.Ссылка.Сотрудник
	|		ИНАЧЕ ЗаявкаРаботы.Сотрудник
	|	КОНЕЦ КАК Сотрудник
	|ИЗ
	|	Документ.Заявка.Работы КАК ЗаявкаРаботы
	|ГДЕ
	|	ЗаявкаРаботы.Ссылка = &ТекущийДокумент";
	Выборка = Запрос.Выполнить().Выгрузить();
	
	Если СсылкаНаОбъект.НесколькоСотрудников Тогда
		Шапка = "ШапкаТаблицыСотрудника" ;
		Строка = "СтрокаСотрудника" ;
		Сотрудника = СсылкаНаОбъект.Сотрудник;
		ОбластьМакета.Параметры.ПредставлениеПоставщика = СсылкаНаОбъект.Сотрудник;
		Для каждого СтрокаТабличнойЧасти из Выборка Цикл
			Если НЕ СТрокаТабличнойЧасти.Сотрудник = СсылкаНаОбъект.Сотрудник Тогда
				Если НЕ СтрокаТабличнойЧасти.Сотрудник = Справочники.Сотрудники.ПустаяСсылка() Тогда
					Сотрудника = "" + Сотрудника + ", "  + СтрокаТабличнойЧасти.Сотрудник ; 
					ОбластьМакета.Параметры.ПредставлениеПоставщика = Сотрудника;
				КонецЕсли;
			КонецЕсли; 
		КонецЦикла;
	Иначе
		ОбластьМакета.Параметры.ПредставлениеПоставщика = СсылкаНаОбъект.Сотрудник;
	КонецЕсли;
	ОбластьМакета.Параметры.ПредставлениеПолучателя = СсылкаНаОбъект.Клиент;
	ОбластьМакета.Параметры.Дата = СсылкаНаОбъект.ДатаНачала;
	ОбластьМакета.Параметры.ДатаНачала	= СсылкаНаОбъект.ВремяНачала;
	ОбластьМакета.Параметры.ДатаКонца	= СсылкаНаОбъект.ВремяОкончания;
	ОбластьМакета.Параметры.ДатаРегистрации = СсылкаНаОбъект.Дата;
	ТабДокумент.Вывести(ОбластьМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("Работы");
	ТабДокумент.Вывести(ОбластьМакета);
	ОбластьШапка = Макет.ПолучитьОбласть(Шапка);
	ОбластьСтрока = Макет.ПолучитьОбласть(Строка);
	ТабДокумент.Вывести(ОбластьШапка);
	НомерСтроки = 0;
	Для Каждого СтрокаТабличнойЧасти Из Выборка Цикл
		НомерСтроки = НомерСТроки +1;
		ОбластьСтрока.Параметры.Заполнить(СтрокаТабличнойЧасти);
		ОбластьСтрока.Параметры.НомерСтроки = НомерСтроки;
		ТабДокумент.Вывести(ОбластьСтрока);
	КонецЦикла;	
	Для ит = 1 по ЧислоДопСтрокРабот Цикл
		НомерСтроки = НомерСтроки +1;	 
		ОбластьМакета = Макет.ПолучитьОбласть(Строка);
		ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;
		ТабДокумент.Вывести(ОбластьМакета);	
	КонецЦикла;	
	ОбластьМакета = Макет.ПолучитьОбласть("ГраницаСотрудник");
	ТабДокумент.Вывести(ОбластьМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("Материалы");
	ТабДокумент.Вывести(ОбластьМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыМатериалы");
	ТабДокумент.Вывести(ОбластьМакета);
	Для ит = 1 По ЧислоСтрокМатериалов Цикл
		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаМатериалы");
		ОбластьМакета.Параметры.НомерСтроки = Ит+1;
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЦикла;
	ОбластьМакета = Макет.ПолучитьОбласть("ГраницаСотрудник");
	ТабДокумент.Вывести(ОбластьМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("ОтметкиСотрудника");
	ТабДокумент.Вывести(ОбластьМакета);
	
КонецПроцедуры

Функция ПечатьЗаявка(СсылкаНаОбъект)
	
	Перем Выборка;
	
	ТабДокумент = Новый ТабличныйДокумент;
	Макет       = Документы.Заявка.ПолучитьМакет("Заявка");
	СформироватьШапкуТелоПечатиЗаявки(СсылкаНаОбъект, ТабДокумент, Макет, 6, 12, Выборка);
	
	Если СсылкаНаОбъект.НесколькоСотрудников Тогда
		Для Каждого СтрокаТабличнойЧасти из Выборка Цикл
			ОбластьПодпись = Макет.ПолучитьОбласть("Подпись");
			ОбластьПодпись.Параметры.Сотрудник = СтрокаТабличнойЧасти.Сотрудник;
			ТабДокумент.Вывести(ОбластьПодпись);
		КонецЦикла
	Иначе
		ОбластьПодпись = Макет.ПолучитьОбласть("Подпись");
		ОбластьПодпись.Параметры.Сотрудник = СсылкаНаОбъект.Сотрудник;
		ТабДокумент.Вывести(ОбластьПодпись);
	КонецЕсли;	
	
	ТабДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Заявка_Заявка";
	
	Возврат ТабДокумент;
	
КонецФункции // ПечатьАктаОбОказанииУслуг()

Функция ПечатьЗаявкаА5(СсылкаНаОбъект)
	
	Перем Выборка;
	
	ТабДокумент = Новый ТабличныйДокумент;
	Макет       = Документы.Заявка.ПолучитьМакет("ЗаявкаА5");
	СформироватьШапкуТелоПечатиЗаявки(СсылкаНаОбъект, ТабДокумент, Макет, 2, 5, Выборка);
	
	Подпись = Истина;
	Если СсылкаНаОбъект.НесколькоСотрудников Тогда
		Для каждого СтрокаТабличнойЧасти из Выборка Цикл
			Если Подпись Тогда
				ОбластьПодпись = Макет.ПолучитьОбласть("Подпись");
				ОбластьПодпись.Параметры.Сотрудник = СтрокаТабличнойЧасти.Сотрудник;
				ТабДокумент.Вывести(ОбластьПодпись);
				Подпись=Ложь;
			Иначе
				ОбластьПодпись = Макет.ПолучитьОбласть("Подпись");
				ОбластьПодпись.Параметры.Сотрудник = СтрокаТабличнойЧасти.Сотрудник;
				ТабДокумент.Присоединить(ОбластьПодпись);
				Подпись=Истина;
			КонецЕсли;
		КонецЦикла
	Иначе
		ОбластьПодпись = Макет.ПолучитьОбласть("Подпись");
		ОбластьПодпись.Параметры.Сотрудник = СсылкаНаОбъект.Сотрудник;
		ТабДокумент.Вывести(ОбластьПодпись);
	КонецЕсли;	
	
	ТабДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Заявка_ЗаявкаА5";
	
	Возврат ТабДокумент;
	
КонецФункции 

Функция ПечатьТалон(СсылкаНаОбъект)
	ТабДокумент = новый ТабличныйДокумент;
	Макет=ПолучитьМакет("Талон");
	
	ОбластьШапки = Макет.ПолучитьОбласть("Шапка");
    ОбластьШапки.Параметры.НазваниеОрганизации = ПроцедурыСпециализацииПоставки.ПолучитьРеквизитыОрганизации(СсылкаНаОбъект).НазваниеОрганизации;
	ОбластьШапки.Параметры.ФИО = СсылкаНаОбъект.Клиент.Фамилия + " " + СсылкаНаОбъект.Клиент.Имя + " " + СсылкаНаОбъект.Клиент.Отчество; 	
	ОбластьШапки.Параметры.ДатаРождения = СсылкаНаОбъект.Клиент.ДатаРождения;
	ОбластьШапки.Параметры.Пол = ?(СсылкаНаОбъект.Клиент.Пол=Перечисления.ПолФизическихЛиц.НеУказан,"",СсылкаНаОбъект.Клиент.Пол);
	ОбластьШапки.Параметры.ДатаПриема = Формат(СсылкаНаОбъект.ДатаНачала,"ДФ='dd.MM.yyyy HH:mm'");
	ТабДокумент.Вывести(ОбластьШапки);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", СсылкаНаОбъект);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаявкаРаботы.Номенклатура КАК Работа,
	|	ЗаявкаРаботы.Продолжительность КАК Длительность,
	|	ВЫБОР
	|		КОГДА ЗаявкаРаботы.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|			ТОГДА ЗаявкаРаботы.Ссылка.Сотрудник
	|		ИНАЧЕ ЗаявкаРаботы.Сотрудник
	|	КОНЕЦ КАК Врач
	|ИЗ
	|	Документ.Заявка.Работы КАК ЗаявкаРаботы
	|ГДЕ
	|	ЗаявкаРаботы.Ссылка = &ТекущийДокумент";
	Выборка = Запрос.Выполнить().Выгрузить();
	
	ОбластьШапка = Макет.ПолучитьОбласть("ШапкаУслуг");
	ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаУслуг");
	ТабДокумент.Вывести(ОбластьШапка);
	НомерСтроки = 0;
	Для Каждого СтрокаТабличнойЧасти Из Выборка Цикл
		НомерСтроки = НомерСТроки +1;
		ОбластьСтрока.Параметры.Заполнить(СтрокаТабличнойЧасти);
		ОбластьСтрока.Параметры.НомерСтроки = НомерСтроки;
		ТабДокумент.Вывести(ОбластьСтрока);
	КонецЦикла;		

    ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвал.Параметры.Врач = СсылкаНаОбъект.Сотрудник;	
	ТабДокумент.Вывести(ОбластьПодвал);
	
	ТабДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Заявка_Талон";
	
	Возврат ТабДокумент;
КонецФункции

Функция ПечатьСтоимостьУслуг(СсылкаНаОбъект)
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОтображатьСетку = Ложь;
	ТабДокумент.АвтоМасштаб = Истина;
	
	Макет = ПолучитьМакет("СтоимостьУслуг");
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	
	РеквизитыОрганизации = ПроцедурыСпециализацииПоставки.ПолучитьРеквизитыОрганизации(СсылкаНаОбъект);	
	ОбластьШапка.Параметры.НазваниеОрганизации = РеквизитыОрганизации.НазваниеОрганизации;
	ОбластьШапка.Параметры.АдресОрганизации = РеквизитыОрганизации.Адрес;
	ОбластьШапка.Параметры.ТелефонОрганизации = РеквизитыОрганизации.Телефон;
	
	ОбластьШапка.Параметры.КлиентФИО = СсылкаНаОбъект.Клиент.Фамилия + " " + СсылкаНаОбъект.Клиент.Имя + " " + СсылкаНаОбъект.Клиент.Отчество;
	Адрес = КонтактнаяИнформацияСервер.ПолучитьКИОбъекта(СсылкаНаОбъект.Клиент, Перечисления.ТипыКонтактнойИнформации.Адрес);
	Телефон = КонтактнаяИнформацияСервер.ПолучитьКИОбъекта(СсылкаНаОбъект.Клиент, Перечисления.ТипыКонтактнойИнформации.Телефон);
	ОбластьШапка.Параметры.КлиентАдрес = Адрес;
	ОбластьШапка.Параметры.КлиентТелефон = Телефон;
	ТабДокумент.Вывести(ОбластьШапка);
		
	ОбластьПланШапка = Макет.ПолучитьОбласть("ОбластьПланШапка");
	ТабДокумент.Вывести(ОбластьПланШапка);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаявкаРаботы.Номенклатура,
	|	ЗаявкаРаботы.Ссылка.ДатаНачала КАК Назначено,
	|	ЗаявкаРаботы.Продолжительность,
	|	ЗаявкаРаботы.ДатаНачала,
	|	ЗаявкаРаботы.ДатаОкончания
	|ПОМЕСТИТЬ УслугиПоЗаявке
	|ИЗ
	|	Документ.Заявка.Работы КАК ЗаявкаРаботы
	|ГДЕ
	|	ЗаявкаРаботы.Ссылка = &Заявка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПланыЛеченияПоПриему.Номенклатура,
	|	ПланыЛеченияПоПриему.Продолжительность,
	|	ПланыЛеченияПоПриему.Назначено,
	|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена,
	|	ПланыЛеченияПоПриему.ДатаНачала,
	|	ПланыЛеченияПоПриему.ДатаОкончания
	|ИЗ
	|	УслугиПоЗаявке КАК ПланыЛеченияПоПриему
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Дата, Прейскурант = &Прейскурант) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО ПланыЛеченияПоПриему.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура";
	Запрос.УстановитьПараметр("Заявка", СсылкаНаОбъект);
	Запрос.УстановитьПараметр("Дата", СсылкаНаОбъект.Дата);
	Запрос.УстановитьПараметр("Прейскурант", УправлениеНастройками.ПолучитьПрейскурантФилиала(СсылкаНаОбъект.Филиал));
	Выборка = Запрос.Выполнить().Выбрать();
	СуммаИтого = 0;
	Пока Выборка.Следующий() Цикл
		ОбластьПланСтрока = Макет.ПолучитьОбласть("ОбластьПланСтрока");
		ОбластьПланСтрока.Параметры.Заполнить(Выборка);
		
		КоличествоУслуги = 1;
		Если Выборка.Номенклатура.ПродолжительностьЕдиницыУслуги <> 0 Тогда
			ПродолжительностьВМин = (Выборка.ДатаОкончания - Выборка.ДатаНачала)/60;
			КоличествоУслуги = Окр((ПродолжительностьВМин/Выборка.Номенклатура.ПродолжительностьЕдиницыУслуги)+0.5,0,0);
		КонецЕсли;
		СуммаУслуги = Выборка.Цена * КоличествоУслуги;
		ОбластьПланСтрока.Параметры.Количество = КоличествоУслуги;
		ОбластьПланСтрока.Параметры.Сумма = СуммаУслуги;
		
		СуммаИтого = СуммаИтого + СуммаУслуги;
			
		ОбластьПланСтрока.Параметры.Назначено = Формат(Выборка.Назначено,"ДФ=dd.MM.yyyy");
		ТабДокумент.Вывести(ОбластьПланСтрока);
	КонецЦикла;
	ОбластьПланИтог = Макет.ПолучитьОбласть("ОбластьПланИтог");
	ОбластьПланИтог.Параметры.СуммаИтого = ОбщегоНазначенияКлиентСервер.ФорматСумм(СуммаИтого);
	ОбластьПланИтог.Параметры.Валюта = ОбщегоНазначения.ПолучитьКраткоеНаименованиеОсновнойВалюты();
	ТабДокумент.Вывести(ОбластьПланИтог);
	
	ТабДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Заявка_СтоимостьУслуг";
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ПечатьПодготовкаКИсследованию(СсылкаНаОбъект)
	
	мНоменклатура = СсылкаНаОбъект.Работы.ВыгрузитьКолонку("Номенклатура");
	ТабличныйДокумент = Документы.ДействияНадАнализами.ПолучитьТабДокПодготовкаКИсследованию(мНоменклатура);
	
	Возврат ТабличныйДокумент;

КонецФункции

#КонецОбласти
